Revit 2015 API
View3D.IsSectionBoxActive Property
 Identifies whether or not the section box is active.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public bool IsSectionBoxActive { get; set; }
Visual Basic
Public Property IsSectionBoxActive As Boolean
	Get
	Set
Visual C++
public:
property bool IsSectionBoxActive {
	bool get ();
	void set (bool value);
}
Field Value
 True if the section box is active, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  View cannot be a template view.
See Also
View3D Class
Autodesk.Revit.DB Namespace